<!DOCTYPE html>
<html>
    <head>
        <meta charset = UTF-8>
        <title>Курсы PHP</title>
        <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.0-beta3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-eOJMYsd53ii+scO/bJGFsiCZc+5NDVN2yr8+0RDqr0Ql0h+rP48ckxlpbzKgwra6" crossorigin="anonymous">
        <link rel="stylesheet" href="main.css">
    </head>
    <body>
        <p class="first">Курсы по языку программирования PHP</p>
        <div>
            <!-- тест -->
        </div>
        <p class="ask">Хотите сменить профессию и работать удаленно? Хотите войти в IT?
        Пройдя один из наших курсов, вы научитесь делать сайты. Изучите <b>HTML</b>, <b>CSS</b>, <b>PHP</b>, а также попробуете
        <b>bootstrap</b>, <b>github</b>, работу с <b>СУБД</b>. Не стоит пугаться этих слов. С вами будет наставник.
        Все вышеперечисленные технологии позволят вам научиться создавать полноценные сайты.
        </p>
        <p class="about"><b>О PHP:</b>  
        это язык программирования, созданный для разработки веб-приложений. PHP позволяет писать скрипты,
        которые будут генерировать html страницы, учитывая данные из СУБД. Но созданием
        веб-приложений возможности языка не ограничиваются.</p>
        <p class="something">Немного о вышеупомянутых технологиях:<br>
        <b>PHP</b> - мозги сайта;<br>
        <b>HTML</b> - скелет сайта, текст;<br>
        <b>CSS</b> - отвечает за дизайн сайта;<br>
        <b>Bootstrap</b> - набор инструментов(фреймворк) из html, css, js решений;<br>
        <b>Github</b> - платформа где вы можете разместить свой проект и ознакомиться с чужым кодом;<br>
        <b>СУБД</b> - система управления базами данных. Это таблицы, в которых хранятся данные, введенные пользователями и вами;</p>
        <hr>
        <div class="container">
            <div class="row">
                <div class="col">
                <p class="+"><h1 style=text-align:center;>+</h1>PHP не сложен в изучении<br>
                Высокая скорость работы<br>
                Функциональность<br>
                </div>
                <div class="col">
                <h1 style=text-align:center;>-</h1>Часто PHP не заслуженно поливают грязью.<br>
                Неоднозначность: код может быть растолкован по разному. Я не считаю это серьезным промахом PHP.<br>
                "Не бывает плохих языков — бывают плохие программисты."
                </p>
                </div>

    </body>
</html>
